// Пользователь:

// Возраст
// Наличие работы
// Деньги
// Нужно проверить может ли он купить новый MacBook за 2000$? 
// Он может брать не только свои деньги, но и взять кредит. 
// Ему дадут 500$, только если ему больше 24-х лет и он имеет работу, 100$ если ему просто больше 24-х лет и 0 в ином случае. Напишите функцию, которая принимает данные пользователя и товара и возвращает true или false.


// Задача: Написать функцию, определяющую, может ли пользователь позволить себе покупку товара исходя из его финансов и возможности получения кредита.

// Условия:

// Пользователь хочет купить MacBook стоимостью $2000.
// Параметры пользователя: возраст, наличие работы, собственные деньги.
// Кредит:

// $500, если возраст > 24 года и есть работа.
// $100, если возраст > 24 года, работы нет.
// $0 в остальных случаях.