// Задача
// Реализовать функцию, выполняющую обратную операцию фильтрации массива чисел.

// Функция принимает в качестве аргументов другую функцию (функцию удаления) и массив чисел.
// Функция удаления определяет, нужно ли удалять элемент массива (возвращает true) или оставить (возвращает false).
// Шаги реализации
// Определить функцию высшего порядка, принимающую массив чисел и функцию удаления.
// Итерировать через каждый элемент массива, применяя функцию удаления для определения, оставлять элемент в массиве или удалить.
// Возвращать отфильтрованный массив, где остаются только те элементы, которые не подлежат удалению.
// Пример
// Для функции удаления, удаляющей все числа больше 5:

// Входной массив: [3, 6, 9, 2]
// Выходной массив: [3, 2] (числа 6 и 9 удалены, так как они больше 5)


const arr = [3, 6, 9, 2];

function deleteElement(arr){
    let newArr = [...arr]
    for(i=0; i < newArr.length; i++){
        if(newArr[i] > 5){
            newArr.splice(i, 1)
            i--;
        }
    }
    return newArr
}


function deleteElementsFromArray(arr, deleteElement){
    
        let sortedArr = deleteElement(arr) 
        return sortedArr;
    }

console.log(deleteElementsFromArray(arr, deleteElement))


